app/controllers/complaints_controller.rb

  def index
    @complaints = Complaint.all
---
SELECT "complaints".* FROM "complaints"

  def create
    @complaint = Complaint.new(complaint_params)

    respond_to do |format|
      if @complaint.save
---
INSERT INTO "complaints" ("created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Dec 2013 11:21:33 UTC +00:00], ["date", Sat, 07 Dec 2013], ["description", ""], ["title", ""], ["updated_at", Sat, 07 Dec 2013 11:21:33 UTC +00:00]]

    def set_complaint
      @complaint = Complaint.find(params[:id])
---
SELECT "complaints".* FROM "complaints" WHERE "complaints"."id" = ? LIMIT 1  [["id", "1"]]