app/controllers/suggestions_controller.rb

SELECT "suggestions".* FROM "suggestions"
---
  def index
    @suggestions = Suggestion.all

INSERT INTO "suggestions" ("created_at", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 07 Dec 2013 08:07:20 UTC +00:00], ["date", Sat, 07 Dec 2013], ["description", ""], ["title", ""], ["updated_at", Sat, 07 Dec 2013 08:07:20 UTC +00:00]]
---
  def create
    @suggestion = Suggestion.new(suggestion_params)

    respond_to do |format|
      if @suggestion.save

DELETE FROM "suggestions" WHERE "suggestions"."id" = ?  [["id", 1]]
---
  def destroy
    @suggestion.destroy

SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_suggestion
      @suggestion = Suggestion.find(params[:id])