app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Dec 2013 09:51:18 UTC +00:00], ["email", "nagehan.kekilli@gmail.comi"], ["updated_at", Thu, 12 Dec 2013 09:51:18 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    if @user.save